{"URL": "https://www.blueapron.com/recipes/honey-mustard-chicken-with-roasted-winter-vegetables", "Ingredients": [["4.00", "Boneless,", " Skinless Chicken Breasts"], ["2.00", "Carrots", "Carrots"], ["1.00", "Head", " Cauliflower"], ["0.50", "Pound", " Brussels Sprouts"], ["1.00", "Bunch", " Parsley"], ["3.00", "Tablespoons", " Dijon Mustard"], ["1.00", "Tablespoon", " Honey"], ["0.33", "Cup", " Roasted Almonds"], ["0.25", "Cup", " White Wine Vinegar"], ["0.25", "Cup", " Honey Mustard Spice Blend (All-Purpose Flour, Garlic Powder, Onion Powder & Sweet Paprika)"]], "Instructions": [["1", "Prepare the ingredients:", "Preheat the oven to 475°F. Wash and dry the fresh produce. Cut out and discard the core of the cauliflower; cut into bite-sized florets. Peel the carrots; halve lengthwise, then cut crosswise into ½-inch- thick pieces. Cut off and discard the stem ends of the Brussels sprouts; halve lengthwise. Roughly chop the almonds. Finely chop the parsley leaves and stems."], ["2", "Roast the vegetables:", "Place the cauliflower, carrots and Brussels sprouts on a sheet pan; drizzle with 1 ½ tablespoons of olive oil and season with salt and pepper. Toss to thoroughly coat. Arrange in a single, even layer. Roast 18 to 20 minutes, or until browned and tender when pierced with a fork. Remove from the oven."], ["3", "Coat & cook the chicken:", "Once the vegetables have roasted for about 5 minutes, place the spice blend on a plate. Pat the chicken dry with paper towels; season with salt and pepper on both sides. Thoroughly coat the seasoned chicken with the spice blend (tapping off any excess). Transfer to a separate plate. In a large pan (nonstick, if you have one), heat 2 tablespoons of olive oil on medium-high until hot. Add the coated chicken and cook 4 to 6 minutes per side, or until browned and cooked through. Leaving any browned bits (or fond) in the pan, transfer to a plate and set aside in a warm place."], ["4", "Finish the vegetables:", "Add the roasted vegetables and vinegar to the pan of reserved fond (be careful, as the vinegar may splatter). Cook on medium-high, scraping up any fond from the bottom of the pan, 1 to 2 minutes, or until thoroughly combined. Turn off the heat and stir in the almonds and all but a pinch of the parsley; season with salt and pepper to taste."], ["5", "Make the honey-mustard sauce:", "In a bowl, combine the honey and mustard; season with salt and pepper to taste. Transfer to a serving dish."], ["6", "Serve your dish:", "Divide the finished vegetables between 4 dishes and top with the cooked chicken. Garnish with the remaining parsley. Serve with the honey-mustard sauce on the side. Enjoy!"]]}