{"URL": "https://www.blueapron.com/recipes/maple-gravy-smothered-pork-chops-with-collard-greens-roasted-sweet-potatoes", "Ingredients": [["2.00", "Boneless,", " Center-Cut Pork Chops"], ["3.00", "Cloves", " Garlic"], ["1.00", "Bunch", " Collard Greens"], ["0.50", "Pound", " Sweet Potato"], ["1.00", "Bunch", " Sage"], ["2.00", "Tablespoons", " Butter"], ["2.00", "Tablespoons", " Maple Syrup"], ["2.00", "Tablespoons", " Quark"], ["2.00", "Tablespoons", " White Vinegar"], ["1.00", "Ounce", " Sweet Piquante Peppers"], ["1.00", "Tablespoon", " Gravy Spice Blend (All-Purpose Flour, Garlic Powder, Onion Powder & Ground White Pepper)"]], "Instructions": [["1", "Prepare the ingredients:", "Preheat the oven 450°F. Wash and dry the fresh produce. Medium dice the sweet potatoes. Peel and finely chop the garlic. Finely chop the peppers. Remove and discard the collard green stems; roughly chop the leaves. Pick the sage leaves off the stems; discard the stems and finely chop the leaves."], ["2", "Roast the sweet potato:", "Place the sweet potato on a sheet pan. Drizzle with olive oil and season with salt and pepper; toss to thoroughly coat. Arrange in a single, even layer. Roast, stirring halfway through, 18 to 20 minutes, or until browned and tender when pierced with a fork. Remove from the oven. Set aside in a warm place."], ["3", "Cook the collard greens:", "While the sweet potato roasts, in a medium pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the garlic and peppers; season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until softened and fragrant. Add the collard greens and season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until slightly wilted. Add half the vinegar and 1/2 cup of water. Cook, stirring occasionally, 6 to 7 minutes, or until wilted and the water has cooked off. Turn off the heat and season with salt and pepper to taste."], ["4", "Cook the pork chops:", "While the collard greens cook, pat the pork chops dry with paper towels; season with salt and pepper on both sides. In a medium pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned pork chops and cook 3 to 5 minutes per side, or until browned and cooked through. Leaving any browned bits (or fond) in the pan, transfer to a cutting board and let rest for at least 5 minutes."], ["5", "Make the gravy:", "While the pork chops rest, to the pan of reserved fond, add the butter, spice blend, maple syrup, sage, remaining vinegar and 1/4 cup of water; season with salt and pepper. Cook on medium-high, whisking frequently, 30 seconds to 1 minute, or until thickened. Turn off the heat and whisk in the quark; season with salt and pepper to taste."], ["6", "Plate your dish:", "Divide the rested pork chops, roasted sweet potato and cooked collard greens between 2 dishes. Top the pork chops with a spoonful of the gravy (you may have extra gravy). Enjoy!"]]}