{"URL": "https://www.blueapron.com/recipes/meatloaf-with-parsnip-sweet-potato-oven-fries", "Ingredients": [["1⅛", "Pounds Ground Beef"], ["2", "Farm Eggs"], ["4", "Cloves Garlic"], ["1¼", "Pounds Parsnips"], ["1", "Pound Sweet Potatoes"], ["1", "Red Onion"], ["1", "Large Bunch Parsley"], ["1", "Tablespoon Vegetarian Worcestershire Sauce"], ["½", "Cup Ketchup"], ["⅓", "Cup Panko Breadcrumbs"], ["1½", "Tablespoons Meatloaf Spice Blend (Montreal Steak Seasoning, Italian Seasoning, Ground Mustard & Crushed Aleppo Pepper)"]], "Instructions": [["1", "Prepare the ingredients:", "Preheat the oven to 450°F. Wash and dry the fresh produce. Peel and mince the garlic. Peel and small dice the onion. Finely chop the parsley leaves and stems. Peel the parsnips; cut the parsnips and sweet potatoes lengthwise into ½-inch-thick sticks."], ["2", "Cook the aromatics:", "In a medium pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the garlic, onion and ¾ of the spice blend; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until softened and fragrant. Transfer to a large bowl."], ["3", "Start the meatloaf:", "To the bowl of cooked aromatics, add the ground beef, eggs, breadcrumbs, Worcestershire sauce, half the parsley and half the ketchup; season with salt and pepper. Mix until combined."], ["4", "Form & bake the meatloaf:", "Place a large piece of aluminum foil (or parchment paper) on a clean, dry work surface. Place the ground beef mixture in the center of the foil. Gently roll and shape the mixture with the foil until it forms a tightly-packed, 10-inch by 3-inch loaf. Transfer the loaf and foil to a sheet pan (unrolling and flattening the foil to line the pan); evenly spread the remaining ketchup on top of the loaf. Bake 28 to 30 minutes, or until lightly browned and cooked through. Remove from the oven and carefully transfer to a serving dish. Let rest for at least 5 minutes."], ["5", "Make the parsnip & sweet potato oven fries:", "While the meatloaf bakes, place the parsnips and sweet potatoes on a sheet pan. Drizzle with olive oil; season with salt, pepper and the remaining spice blend. Toss to thoroughly coat and arrange in a single, even layer. Place on a separate oven rack and roast 28 to 30 minutes, or until lightly browned and tender when pierced with a fork. Remove from the oven and transfer to a serving dish."], ["6", "Serve your dish:", "Slice the rested meatloaf into ¾-inch-thick pieces. Serve with the parsnip and sweet potato oven fries on the side. Garnish with the remaining parsley. Enjoy!"]]}