{"URL": "https://www.blueapron.com/recipes/mozzarella-ricotta-calzones-with-kale-spicy-tomato-dipping-sauce", "Ingredients": [["1½", "Pounds", " Plain Pizza Dough"], ["1.00", "5-Ounce", " Can Crushed Tomatoes"], ["1.00", "Cup", " Part-Skim Ricotta Cheese"], ["0.50", "Pound", " Fresh Mozzarella Cheese"], ["4.00", "Cloves", " Garlic"], ["1.00", "Bunch", " Kale"], ["3.00", "Tablespoons", " Golden Raisins"], ["0.25", "Teaspoon", " Crushed Red Pepper Flakes"]], "Instructions": [["1", "Prepare the ingredients:", "Remove the dough from the refrigerator to bring to room temperature. Preheat the oven to 475°F. Wash and dry the fresh produce. Peel and thinly slice the garlic. Remove and discard the kale stems; roughly chop the leaves. Tear the mozzarella cheese into bite-sized pieces."], ["2", "Make the tomato sauce:", "In a medium pot, heat 1 teaspoon of olive oil on medium-high until hot. Add half the garlic and as much of the red pepper flakes as you’d like, depending on how spicy you’d like the dish to be; season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the tomatoes; season with salt and pepper. Cook, stirring occasionally, 2 to 4 minutes, or until thoroughly combined and heated through. Remove from heat and season with salt and pepper to taste."], ["3", "Cook & drain the kale:", "While the tomato sauce cooks, in a large pan (nonstick, if you have one), heat 1 teaspoon of olive oil on medium-high until hot. Add the remaining garlic. Cook, stirring constantly, 30 to 45 seconds, or until fragrant. Add the kale, raisins and 2 tablespoons of water; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the kale has wilted and the water has cooked off. Transfer to a strainer; hold or rest over a bowl. Using a spoon, press down on the cooked kale to release as much liquid as possible; discard the liquid."], ["4", "Make the filling:", "In a large bowl, combine the drained kale, mozzarella cheese, ricotta cheese and ⅓ of the tomato sauce; stir to thoroughly combine. Season with salt and pepper to taste."], ["5", "Assemble the calzones:", "Lightly oil a sheet pan. Divide the dough into 4 equal-sized portions; using your hands, gently stretch into ¼-inch-thick rounds. (If the dough is resistant, let rest for 5 minutes.) Divide some of the filling (you will have extra) between the rounds. Fold each round in half over the filling. Using your fingers or a fork, press or crimp the edges of the dough to seal. Transfer to the prepared sheet pan."], ["6", "Bake the calzones & serve your dish:", "Lightly drizzle or brush the tops of the calzones with olive oil. Bake 16 to 18 minutes, or until golden brown. Remove from the oven and let stand for at least 2 minutes. Transfer to a serving dish. Transfer the remaining tomato sauce to a serving dish; serve on the side. Enjoy!"]]}