{"URL": "https://www.blueapron.com/recipes/roast-chicken-with-mashed-potatoes-maple-glazed-carrots", "Ingredients": [["2.00", "Boneless,", " Skin-On Chicken Breasts"], ["0.75", "Pound", " Yukon Gold Potatoes"], ["2.00", "Carrots", "Carrots"], ["1.00", "Lemon", "Lemon"], ["2.00", "Tablespoons", " Chicken Demi-Glace"], ["2.00", "Tablespoons", " Butter"], ["1.00", "Tablespoon", " Maple Syrup"]], "Instructions": [["1", "Prepare the ingredients:", "Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Large dice the potatoes. Peel and quarter the carrots lengthwise; cut into 2-inch-long pieces on an angle. Using a peeler, remove the yellow rind of the lemon, avoiding the white pith; mince the rind to get 2 teaspoons of zest (or use a zester). Quarter and deseed the lemon."], ["2", "Cook & mash the potatoes:", "Add the potatoes to the pot of boiling water and cook 14 to 16 minutes, or until tender when pierced with a fork. Drain thoroughly and return to the pot. Off the heat, add half the butter. Using a fork, mash to your desired consistency; season with salt and pepper to taste. Set aside in a warm place."], ["3", "Cook & glaze the carrots:", "While the potatoes cook, in a large pan, heat 2 teaspoons of olive oil on medium until hot. Add the carrots; season with salt and pepper. Cook, stirring occasionally, 4 to 6 minutes, or until softened. Stir in the syrup, the juice of 2 lemon wedges and ¼ cup of water; season with salt and pepper. Cook, stirring occasionally, 3 to 5 minutes, or until the liquid is almost completely reduced in volume. Remove from heat and add the remaining butter; stir until thoroughly combined and the carrots are coated. Transfer to a plate and set aside in a warm place. Rinse and dry the pan."], ["4", "Cook the chicken:", "Pat the chicken dry with paper towels; season with salt and pepper on both sides. In the pan used to cook the carrots, heat 2 teaspoons of olive oil on medium-high until hot. Add the seasoned chicken, skin sides down. Cook, loosely covering the pan with aluminum foil, 4 to 6 minutes per side, or until browned and cooked through. Transfer to a cutting board, leaving any browned bits (or fond) in the pan, and set aside in a warm place."], ["5", "Make the pan sauce:", "Add ¼ cup of water to the pan of reserved fond and cook on medium, stirring frequently and scraping up any browned bits from the bottom of the pan, 1 to 2 minutes, or until slightly reduced in volume. Add the lemon zest and demi-glace; cook, stirring frequently, 1 to 2 minutes, or until slightly reduced in volume. Remove from heat; season with salt and pepper to taste."], ["6", "Plate your dish:", "Thinly slice the cooked chicken crosswise; add any juices from the cutting board to the pan sauce and stir to combine. Divide the sliced chicken, mashed potatoes and glazed carrots between 2 plates. Top with a few spoonfuls of the pan sauce. Garnish with the remaining lemon wedges, if you’d like. Enjoy!"]]}