{"URL": "https://www.blueapron.com/recipes/seared-steaks-cheddar-mashed-potatoes-with-roasted-brussels-sprouts-steak-sauce", "Ingredients": [["2", "Steaks"], ["3", "Cloves Garlic"], ["2", "Scallions"], ["1", "Pound Russet Potatoes"], ["¾", "Pound Brussels Sprouts"], ["4", "Tablespoons Butter"], ["2", "Tablespoons Ketchup"], ["1", "Tablespoon Molasses"], ["1", "Tablespoon Red Wine Vinegar"], ["1", "Tablespoon Soy Glaze"], ["2", "Ounces Cheddar Cheese"]], "Instructions": [["1", "Prepare the ingredients:", "Preheat the oven to 450°F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Cut off and discard the stem ends of the Brussels sprouts; halve lengthwise. Peel and large dice the potatoes. Grate the cheese. Peel and mince the garlic. Cut off and discard the root ends of the scallions; thinly slice, separating the white bottoms and green tops."], ["2", "Roast the Brussels sprouts:", "Place the Brussels sprouts on a sheet pan. Drizzle with olive oil and season with salt and pepper. Toss to thoroughly coat. Arrange in a single, even layer and roast 14 to 16 minutes, or until browned and softened. Remove from the oven. Season with salt and pepper to taste. Set aside in a warm place."], ["3", "Cook & mash the potatoes:", "While the Brussels sprouts roast, add the potatoes to the pot of boiling water. Cook 14 to 16 minutes, or until tender when pierced with a fork. Turn off the heat. Drain thoroughly and return to the pot. Add the cheese and butter. Using a fork, mash to your desired consistency. Season with salt and pepper to taste. Set aside in a warm place."], ["4", "Cook the steaks:", "While the potatoes cook, pat the steaks dry with paper towels. Season with salt and pepper on both sides. In a large pan (nonstick, if you have one), heat 1 tablespoon of olive oil on medium-high until hot. Add the seasoned steaks. Cook 3 to 4 minutes per side for medium-rare, or until browned and cooked to your desired degree of doneness. Leaving any browned bits (or fond) in the pan, transfer to a cutting board. Let the cooked steaks rest for at least 5 minutes."], ["5", "Make the sauce:", "While the steaks rest, add the garlic and white bottoms of the scallions to the pan of reserved fond. Cook on medium-high, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the soy glaze, vinegar, molasses, ketchup and 2 tablespoons of water (be careful, as the liquid may splatter). Cook, stirring constantly, 45 seconds to 1 minute, or until thoroughly combined. Turn off the heat and season with salt and pepper to taste."], ["6", "Finish & serve your dish:", "Find the lines of muscle (or grain) on the rested steaks; thinly slice crosswise against the grain. Divide the mashed potatoes, roasted Brussels sprouts and sliced steaks between 4 dishes. Top the steaks with the sauce. Garnish the steaks and mashed potatoes with the green tops of the scallions. Enjoy!"]]}