{"URL": "https://www.blueapron.com/recipes/spinach-mozarella-gnocchi-with-cheesy-garlic-bread", "Ingredients": [["2", "Small Baguettes"], ["1", "7.6-Ounce Package Gnocchi"], ["1", "28-Ounce Can Whole Peeled Tomatoes"], ["4", "Ounces Fontina Cheese"], ["½", "Pound Fresh Mozzarella Cheese"], ["3", "Cloves Garlic"], ["1", "Pound Spinach"], ["1", "Large Bunch Parsley"], ["2", "Tablespoons Grated Parmesan Cheese"], ["1", "Tablespoon Gnocchi Spice Blend (Dried Oregano & Dried Basil)"]], "Instructions": [["1", "Prepare the ingredients:", "Preheat the oven to 450°F. Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Halve the baguettes. Peel and roughly chop the garlic. Place the tomatoes in a bowl; gently break apart with your hands. Grate the fontina cheese (discarding any rind). Roughly chop the parsley leaves and stems. Tear the mozzarella cheese into bite-sized pieces."], ["2", "Cook & drain the spinach:", "In a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Working in batches, add the spinach; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes per batch, or until wilted. Transfer to a strainer; hold or rest the strainer over a bowl. Using a spoon, press down on the cooked spinach to release as much liquid as possible; discard the liquid. Wipe out the pot."], ["3", "Make the sauce:", "In the same pot, heat 2 teaspoons of olive oil on medium-high until hot. Add half the garlic and season with salt and pepper. Cook, stirring constantly, 30 seconds to 1 minute, or until fragrant. Add the tomatoes and spice blend. Cook, stirring occasionally, 12 to 14 minutes, or until thickened and slightly reduced in volume. Turn off the heat. Season with salt and pepper to taste."], ["4", "Make the cheesy garlic bread:", "While the sauce cooks, line a sheet pan with aluminum foil. Place the baguettes on the prepared sheet pan, cut sides up. Drizzle with olive oil. In a bowl, combine the remaining garlic and fontina cheese; stir to thoroughly combine. Evenly top the baguettes with the garlic-cheese mixture. Toast in the oven 9 to 11 minutes, or until lightly browned and the cheese has melted. Remove from the oven. When cool enough to handle, transfer to a cutting board and halve crosswise. Transfer to a serving dish and set aside in a warm place."], ["5", "Cook the gnocchi:", "Once the sauce has cooked for about 10 minutes, add the gnocchi to the pot of boiling water. Cook 2 to 3 minutes, or until the gnocchi float to the top of the pot. Drain thoroughly."], ["6", "Finish the gnocchi & serve your dish:", "Add the cooked gnocchi, drained spinach and half the parsley to the pot of sauce. Cook on medium-high, stirring frequently, 1 to 2 minutes, or until combined. Add the mozzarella cheese. Cook, without stirring, 1 to 2 minutes, or until warmed. Stir to thoroughly combine; season with salt and pepper to taste.Transfer to a serving dish. Garnish with the parmesan cheese and remaining parsley. Serve with the cheesy garlic bread on the side. Enjoy!"]]}