{"URL": "https://www.blueapron.com/recipes/stovetop-macaroni-cheese-with-spinach-apple-walnut-salad", "Ingredients": [["¾", "Pound Cavatappi Pasta"], ["6", "Ounces Aged White Cheddar Cheese"], ["¾", "Cup Milk"], ["4", "Ounces Spinach"], ["1", "Apple"], ["1", "Lemon"], ["2", "Tablespoons Crème Fraîche"], ["¼", "Cup Grated Parmesan Cheese"], ["¼", "Cup Panko Breadcrumbs"], ["¼", "Cup Walnuts"], ["¼", "Cup Macaroni & Cheese Spice Blend (All-Purpose Flour, Ground Mustard, Garlic Powder & Ground Nutmeg)"]], "Instructions": [["1", "Prepare the ingredients:", "Wash and dry the fresh produce. Heat a medium pot of salted water to boiling on high. Grate the cheddar cheese. Quarter and deseed the lemon. Core the apple and cut into matchsticks; toss with the juice of 1 lemon wedge to prevent browning. Roughly chop the walnuts."], ["2", "Cook the pasta:", "Add the pasta to the pot of boiling water. Cook 7 to 9 minutes, or until just shy of al dente (still slightly firm to the bite). Reserving 1¼ cups of the pasta cooking water, drain thoroughly. Set aside in a warm place."], ["3", "Toast the breadcrumbs:", "While the pasta cooks, in a large pot, heat 1 tablespoon of olive oil on medium-high until hot. Add the breadcrumbs; season with salt and pepper. Toast, stirring occasionally, 2 to 4 minutes, or until golden brown. Transfer to a plate. Wipe out the pot."], ["4", "Make the sauce & finish the pasta:", "While the pasta continues to cook, in the pot used to toast the breadcrumbs, heat 2 tablespoons of olive oil on medium until hot. Add the spice blend and cook, stirring constantly, 30 seconds to 1 minute, or until toasted and fragrant. Slowly whisk in the milk and reserved pasta cooking water; heat to boiling on high. Once boiling, reduce the heat to low and simmer, whisking frequently, 4 to 6 minutes, or until thickened. Add the cheddar cheese; season with salt and pepper. Cook, whisking occasionally, 1 to 2 minutes, or until thoroughly combined and smooth. Turn off the heat and stir in the cooked pasta until thoroughly coated; season with salt and pepper to taste. Transfer to a serving dish."], ["5", "Make the dressing:", "While the sauce simmers, in a small bowl, combine the crème fraîche and the juice of the remaining lemon wedges; season with salt and pepper to taste. Slowly whisk in 1 tablespoon of olive oil until well combined."], ["6", "Make the salad & plate your dish:", "Just before serving, in a large bowl, combine the spinach, apple and walnuts; season with salt and pepper. Add enough of the dressing to coat the salad (you may have extra dressing). Toss to mix and season with salt and pepper to taste. Transfer to a serving dish. Garnish the finished pasta with the Parmesan cheese and toasted breadcrumbs. Serve with the salad on the side. Enjoy!"]]}